
// 1. AND(&&)の条件を作成し、その処理に入るよう作ってください。(elseの処理も作成してください)
var mathScore = 80;
var englishScore = 80;
if (mathScore >= 80 && englishScore >= 80) {
  console.log("よく出来ました!!");
} else {
  console.log("追試です");
};
// ----------------------------------------------
// ----------------------------------------------

// 2. OR(||)の条件を作成し、その処理に入るよう作ってください。(elseの処理も作成してください)
var money = 250;
var point = 100;
var price = 250;
if (money >= price || point >= price) {
  console.log("商品を購入できます。");
} else {
  console.log("商品を購入できません");
};
// ----------------------------------------------
// ----------------------------------------------

// 3. NOT(!)の条件を作成し、その処理に入るよう作ってください。比較条件は数値型の比較でお願いしま
// す。(elseの処理も作成してください)
var num = 100;
if (num !== 100) {
  console.log("numは100以外です");
} else {
  console.log("numは100です。");
};
